In [10]:
import os
import pandas as pd
import numpy as np

In [11]:
dir_path='C:/Users/Chisom/Documents/Moniepoint/test-case-2'
files=os.listdir(dir_path)

## 1) Highest sales volume in a day

In [12]:
sales_vol=[]

In [13]:
# Find the len of each file, each line corresponds to the number of sales that day and append each instance to the sales_vol list
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-2/{file}",delimiter=',', header=None)
    sales_vol_value=len(df)
    sales_vol.append(sales_vol_value)

In [14]:
# Get a dataframe mapping the files to their sales volume (len)
sales_vol_df=pd.DataFrame({'Date':files,'Sales_vol':sales_vol})

#### 2025-10-16 is the day with the highest sales volume, with 999 sales that day

In [15]:
# Sort the sales volume so the biggest value is top
sales_vol_df.sort_values('Sales_vol',ascending=False).head(2)

               Date  Sales_vol
288  2025-10-16.txt        998
289  2025-10-17.txt        998

## 2)Highest sales value in a day

In [16]:
sales_value=[]

In [17]:
# For each day, get the sales value column and then get the total sales value for that day and then save to the sales_value list
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-2/{file}",delimiter=',', header=None)
    sales_value_col=list(df[3])
    total_value=sum(sales_value_col)
    sales_value.append(total_value)

In [18]:
# Get a dataframe mapping the files (each day) to their sales value
sales_value_df=pd.DataFrame({'Date':files,'Sales_value':sales_value})

#### 2025-10-16 is the day with the highest sales value worth about 25534190

In [19]:
# Sort the sales volume so the biggest value is top
sales_value_df.sort_values('Sales_value',ascending=False).head(2)

               Date   Sales_value
288  2025-10-16.txt  2.553419e+07
289  2025-10-17.txt  2.553419e+07

## 4) Highest sales staff ID for each month

In [39]:
staff_sales_df=pd.DataFrame()

In [40]:
# Read the staff_id,timedate and sales value into one dataframe
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-2/{file}",delimiter=',', header=None)
    df=df[[0,1,3]]
    df.rename(columns={0:'staff_id',1:'timedate',3:'sales_value'},inplace=True)
    staff_sales_df=pd.concat([staff_sales_df,df],ignore_index=True)

In [41]:
# Extracting the month column from the timedate column, then I drop the timedate column
staff_sales_df['month']=staff_sales_df['timedate'].str[5:7].astype(int)
staff_sales_df=staff_sales_df[['staff_id','sales_value','month']]

In [42]:
staff_sales_df

        staff_id  sales_value  month
0              9     5676.010      1
1              9    39642.009      1
2              9    39427.691      1
3              1    56270.937      1
4              7    21779.759      1
...          ...          ...    ...
206797         3    55103.410     12
206798         1     6757.362     12
206799         7    56635.424     12
206800         9    12011.401     12
206801         4    24990.700     12

[206802 rows x 3 columns]

In [43]:
# Making smaller dataframes corresponding to the appropriate months
jan=staff_sales_df.loc[staff_sales_df['month']==1]
feb=staff_sales_df.loc[staff_sales_df['month']==2]
mar=staff_sales_df.loc[staff_sales_df['month']==3]
apr=staff_sales_df.loc[staff_sales_df['month']==4]
may=staff_sales_df.loc[staff_sales_df['month']==5]
june=staff_sales_df.loc[staff_sales_df['month']==6]
july=staff_sales_df.loc[staff_sales_df['month']==7]
aug=staff_sales_df.loc[staff_sales_df['month']==8]
sept=staff_sales_df.loc[staff_sales_df['month']==9]
october=staff_sales_df.loc[staff_sales_df['month']==10]
nov=staff_sales_df.loc[staff_sales_df['month']==11]
dec=staff_sales_df.loc[staff_sales_df['month']==12]

In [44]:
jan.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
1     8         4.842825e+07
      5         4.772984e+07

In [45]:
feb.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
2     5         4.845637e+07
      6         4.773301e+07

In [46]:
mar.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
3     8         4.841053e+07
      6         4.742988e+07

In [47]:
apr.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
4     3         5.401765e+07
      6         5.327325e+07

In [48]:
may.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
5     8         4.767256e+07
      4         4.735927e+07

In [49]:
june.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
6     2         4.900210e+07
      9         4.893058e+07

In [50]:
july.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
7     6         5.526785e+07
      2         5.427256e+07

In [51]:
aug.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
8     3         5.545404e+07
      1         5.215691e+07

In [52]:
sept.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
9     7         5.110134e+07
      9         5.079136e+07

In [53]:
october.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
10    2         4.494699e+07
      1         4.442056e+07

In [54]:
nov.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
11    7         4.665479e+07
      5         4.618192e+07

In [55]:
dec.groupby(['month','staff_id']).sum().sort_values('sales_value',ascending=False).head(2)

                 sales_value
month staff_id
12    1         4.921916e+07
      2         4.673122e+07

##### For January, it is Staff_id 8
##### For Febuary, it is Staff_id 5
##### For March, it is Staff_id 8
##### For April, it is Staff_id 3
##### For May, it is Staff_id 8
##### For June, it is Staff_id 2
##### For July, it is Staff_id 6
##### For August, it is Staff_id 3
##### For September, it is Staff_id 7
##### For October, it is Staff_id 2
##### For November, it is Staff_id 7
##### For December, it is Staff_id 1

## 5) Highest hour of the day by average transaction volume

In [56]:
combined_df=pd.DataFrame()

In [57]:
# Read through all the files, save the timedate and value columns in a dataframe called combined_df
for file in files:
    df=pd.read_csv(f"C:/Users/Chisom/Documents/Moniepoint/test-case-2/{file}",delimiter=',', header=None)
    df=df[[1,3]]
    df.rename(columns={1:'timedate',3:'sales_value'},inplace=True)
    combined_df=pd.concat([combined_df,df],ignore_index=True)

In [58]:
combined_df.head()

              timedate  sales_value
0  2025-01-01T12:40:45     5676.010
1  2025-01-01T09:17:54    39642.009
2  2025-01-01T09:57:57    39427.691
3  2025-01-01T14:53:13    56270.937
4  2025-01-01T08:55:33    21779.759

In [59]:
# making a new column called hour by extracting the hour from the timedate col
combined_df['hour']=combined_df['timedate'].str[11:13].astype(int)

In [60]:
# Grouping each hour by the average sales
sales_by_hour=combined_df[['sales_value','hour']].groupby('hour').mean()
sales_by_hour

       sales_value
hour
8     25049.492474
9     24917.123519
10    25018.690451
11    24963.829520
12    24971.308157
13    24989.459363
14    24974.363410
15    25056.656781
16    25073.627296

#### 16 Hours has the highest average transaction volume

In [61]:
# Sort the sales value so the biggest value is top
sales_by_hour.sort_values('sales_value',ascending=False).head(2)

       sales_value
hour
16    25073.627296
15    25056.656781